In [2]:
import pandas as pd

In [4]:
names = ["Poulomi", "Subhayan", "Shaayan"]
pd.Series(names, index=(3, 2, 1))

3     Poulomi
2    Subhayan
1     Shaayan
dtype: object

In [3]:
data = {
    "name": "Subhayan",
    "age": 36,
    "lastname": "Bhattacharya"
}

pd_data = pd.Series(data)
pd_data

name            Subhayan
age                   36
lastname    Bhattacharya
dtype: object

In [6]:
pd_data["name"] = "Poulomi"

In [7]:
pd_data

name             Poulomi
age                   36
lastname    Bhattacharya
dtype: object

In [9]:
import faker

In [10]:
f = faker.Faker()

for i in range(20):
    print(f.name())

Brenda Browning
Maria Adams
Ian Hunter
Alicia Middleton
Sarah Gallegos
Jeffery Jackson
Jessica Lara
Tabitha Dunn
Karen Carter
Joe Everett
Desiree Krause
Michelle James
Aaron Alvarado
Jennifer Russell DVM
Kevin Brooks
Michael Pierce
Elizabeth Williams
Jamie Duncan
Todd Brennan
Kathryn Jones

In [25]:
name_series = pd.Series((f.name() for _ in range(10)), index=range(20, 40, 2))

In [21]:
name_series.values

array(['Deborah Wright', 'Alexandria Valenzuela', 'Dr. Rebecca Terry',
       'Shawn Prince', 'Andrew Martinez', 'Karen Jenkins',
       'Sabrina Robinson', 'Christopher King', 'Daniel Wagner',
       'Thomas Alvarado'], dtype=object)

In [26]:
name_series.keys()

RangeIndex(start=20, stop=40, step=2)

name_series

In [31]:
name_series

20         Ashley Meyer
22       Erik Gutierrez
24      Dr. Leon Medina
26       Nicholas Smith
28    Jennifer Espinoza
30       Dennis Parrish
32          Brian Riggs
34          Brad Castro
36       Daniel Leonard
38       Anne Maldonado
dtype: object

In [32]:
name_series.sum()

'Ashley MeyerErik GutierrezDr. Leon MedinaNicholas SmithJennifer EspinozaDennis ParrishBrian RiggsBrad CastroDaniel LeonardAnne Maldonado'

In [28]:
new_series = pd.Series(i for i in range(20, 40, 2))

In [29]:
new_series

0    20
1    22
2    24
3    26
4    28
5    30
6    32
7    34
8    36
9    38
dtype: int64

In [30]:
new_series.sum()

290

In [33]:
new_series.product()

343266597273600

In [34]:
name_series.product()

TypeError: can't multiply sequence by non-int of type 'str'

In [43]:
pokemon = pd.read_csv("pokemon.csv", usecols=["Pokemon"], squeeze=True)

In [44]:
pokemon

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object

In [47]:
pokemon = pd.read_csv("pokemon.csv", usecols=["Type"])

In [48]:
pokemon

        Type
0      Grass
1      Grass
2      Grass
3       Fire
4       Fire
..       ...
716     Dark
717   Dragon
718     Rock
719  Psychic
720     Fire

[721 rows x 1 columns]

In [53]:
nba = pd.read_csv("nba.csv", usecols=["Name", "Team", "Salary"], squeeze=True)

In [54]:
nba

              Name            Team     Salary
0    Avery Bradley  Boston Celtics  7730337.0
1      Jae Crowder  Boston Celtics  6796117.0
2     John Holland  Boston Celtics        NaN
3      R.J. Hunter  Boston Celtics  1148640.0
4    Jonas Jerebko  Boston Celtics  5000000.0
..             ...             ...        ...
453   Shelvin Mack       Utah Jazz  2433333.0
454      Raul Neto       Utah Jazz   900000.0
455   Tibor Pleiss       Utah Jazz  2900000.0
456    Jeff Withey       Utah Jazz   947276.0
457            NaN             NaN        NaN

[458 rows x 3 columns]

In [81]:
google = pd.read_csv("google_stock_price.csv", squeeze=True)
google.shape

(3012,)

In [59]:
google.is_unique

False

In [66]:
name = pd.Series(f.name() for _ in range(10))

In [67]:
name

0    Margaret Mosley
1     Christine Yang
2      Maurice Flynn
3     Zachary Chavez
4    Kathryn Griffin
5       Hunter Cline
6     Jennifer Burns
7       Michael Hall
8    Patricia Brooks
9       Cynthia King
dtype: object

In [68]:
name.is_unique

True

In [64]:
name.ndim

1

In [65]:
name.shape

(10,)

In [72]:
name.sort_values(ascending=False)

3     Zachary Chavez
8    Patricia Brooks
7       Michael Hall
2      Maurice Flynn
0    Margaret Mosley
4    Kathryn Griffin
6     Jennifer Burns
5       Hunter Cline
9       Cynthia King
1     Christine Yang
dtype: object

In [73]:
name

0    Margaret Mosley
1     Christine Yang
2      Maurice Flynn
3     Zachary Chavez
4    Kathryn Griffin
5       Hunter Cline
6     Jennifer Burns
7       Michael Hall
8    Patricia Brooks
9       Cynthia King
dtype: object

In [75]:
name.sort_index(ascending=False)

9       Cynthia King
8    Patricia Brooks
7       Michael Hall
6     Jennifer Burns
5       Hunter Cline
4    Kathryn Griffin
3     Zachary Chavez
2      Maurice Flynn
1     Christine Yang
0    Margaret Mosley
dtype: object

In [76]:
name.index

RangeIndex(start=0, stop=10, step=1)

In [77]:
name.keys()

RangeIndex(start=0, stop=10, step=1)

In [82]:
google.index

RangeIndex(start=0, stop=3012, step=1)

In [83]:
name.valuesd

AttributeError: 'Series' object has no attribute 'valuesd'

In [84]:
name.values

array(['Margaret Mosley', 'Christine Yang', 'Maurice Flynn',
       'Zachary Chavez', 'Kathryn Griffin', 'Hunter Cline',
       'Jennifer Burns', 'Michael Hall', 'Patricia Brooks',
       'Cynthia King'], dtype=object)

In [85]:
name.index

RangeIndex(start=0, stop=10, step=1)

In [87]:
name[[0..7]

SyntaxError: invalid syntax (<ipython-input-87-03d9c179e09d>, line 1)

In [88]:
name[[1, 3, 5]]

1    Christine Yang
3    Zachary Chavez
5      Hunter Cline
dtype: object

In [90]:
name.count()

10

name

In [91]:
name

0    Margaret Mosley
1     Christine Yang
2      Maurice Flynn
3     Zachary Chavez
4    Kathryn Griffin
5       Hunter Cline
6     Jennifer Burns
7       Michael Hall
8    Patricia Brooks
9       Cynthia King
dtype: object

In [92]:
only_one_name = pd.Series("Subhayan" for _ in range(10))

In [95]:
only_one_name.shape

(10,)

In [96]:
only_one_name.count()

10

In [97]:
only_one_name.describe()

count           10
unique           1
top       Subhayan
freq            10
dtype: object

In [102]:
import random

numbers = pd.Series(random.randint(20, 100) for _ in range(20))

In [107]:
numbers.sort_values(ascending=False)

13    98
4     93
16    90
2     90
15    88
8     88
5     87
14    82
0     81
17    80
12    78
1     72
6     68
11    57
19    48
7     45
3     41
18    36
10    29
9     25
dtype: int64

In [104]:
numbers.describe()

count    20.000000
mean     68.800000
std      23.439957
min      25.000000
25%      47.250000
50%      79.000000
75%      88.000000
max      98.000000
dtype: float64

In [105]:
numbers.idxmax()

13

In [108]:
numbers.value_counts()

90    2
88    2
48    1
78    1
68    1
57    1
36    1
72    1
41    1
45    1
80    1
93    1
81    1
82    1
29    1
87    1
25    1
98    1
dtype: int64

In [109]:
numbers

0     81
1     72
2     90
3     41
4     93
5     87
6     68
7     45
8     88
9     25
10    29
11    57
12    78
13    98
14    82
15    88
16    90
17    80
18    36
19    48
dtype: int64

In [110]:
def assign(number):
    if number % 5 == 0:
        return "Five"
    if number % 7 == 0:
        return "Seven"
    return str(number)

In [112]:
assigned_numbers = numbers.apply(assign)

In [113]:
numbers

0     81
1     72
2     90
3     41
4     93
5     87
6     68
7     45
8     88
9     25
10    29
11    57
12    78
13    98
14    82
15    88
16    90
17    80
18    36
19    48
dtype: int64

In [123]:
pokemon = pd.read_csv("pokemon.csv", usecols=["Pokemon"], squeeze=True)

In [132]:
pokemon.value_counts()

Aggron        1
Persian       1
Swellow       1
Linoone       1
Chesnaught    1
             ..
Meloetta      1
Porygon-Z     1
Gurdurr       1
Jirachi       1
Torterra      1
Name: Pokemon, Length: 721, dtype: int64

In [125]:
pokemon_new = pd.read_csv("pokemon.csv", index_col="Pokemon", squeeze=True)

In [131]:
pokemon_new.value_counts()

Water       105
Normal       93
Grass        66
Bug          63
Psychic      47
Fire         47
Rock         41
Electric     36
Ground       30
Dark         28
Poison       28
Fighting     25
Dragon       24
Ice          23
Ghost        23
Steel        22
Fairy        17
Flying        3
Name: Type, dtype: int64

In [127]:
pokemon.map(pokemon_new)

0        Grass
1        Grass
2        Grass
3         Fire
4         Fire
        ...
716       Dark
717     Dragon
718       Rock
719    Psychic
720       Fire
Name: Pokemon, Length: 721, dtype: object

In [130]:
pokemon_new.to_dict()

{'Bulbasaur': 'Grass',
 'Ivysaur': 'Grass',
 'Venusaur': 'Grass',
 'Charmander': 'Fire',
 'Charmeleon': 'Fire',
 'Charizard': 'Fire',
 'Squirtle': 'Water',
 'Wartortle': 'Water',
 'Blastoise': 'Water',
 'Caterpie': 'Bug',
 'Metapod': 'Bug',
 'Butterfree': 'Bug',
 'Weedle': 'Bug',
 'Kakuna': 'Bug',
 'Beedrill': 'Bug',
 'Pidgey': 'Normal',
 'Pidgeotto': 'Normal',
 'Pidgeot': 'Normal',
 'Rattata': 'Normal',
 'Raticate': 'Normal',
 'Spearow': 'Normal',
 'Fearow': 'Normal',
 'Ekans': 'Poison',
 'Arbok': 'Poison',
 'Pikachu': 'Electric',
 'Raichu': 'Electric',
 'Sandshrew': 'Ground',
 'Sandslash': 'Ground',
 'Nidoran': 'Poison',
 'Nidorina': 'Poison',
 'Nidoqueen': 'Poison',
 'Nidoran♂': 'Poison',
 'Nidorino': 'Poison',
 'Nidoking': 'Poison',
 'Clefairy': 'Fairy',
 'Clefable': 'Fairy',
 'Vulpix': 'Fire',
 'Ninetales': 'Fire',
 'Jigglypuff': 'Normal',
 'Wigglytuff': 'Normal',
 'Zubat': 'Poison',
 'Golbat': 'Poison',
 'Oddish': 'Grass',
 'Gloom': 'Grass',
 'Vileplume': 'Grass',
 'Paras': 'Bug',
 'Parasect': 'Bug',
 'Venonat': 'Bug',
 'Venomoth': 'Bug',
 'Diglett': 'Ground',
 'Dugtrio': 'Ground',
 'Meowth': 'Normal',
 'Persian': 'Normal',
 'Psyduck': 'Water',
 'Golduck': 'Water',
 'Mankey': 'Fighting',
 'Primeape': 'Fighting',
 'Growlithe': 'Fire',
 'Arcanine': 'Fire',
 'Poliwag': 'Water',
 'Poliwhirl': 'Water',
 'Poliwrath': 'Water',
 'Abra': 'Psychic',
 'Kadabra': 'Psychic',
 'Alakazam': 'Psychic',
 'Machop': 'Fighting',
 'Machoke': 'Fighting',
 'Machamp': 'Fighting',
 'Bellsprout': 'Grass',
 'Weepinbell': 'Grass',
 'Victreebel': 'Grass',
 'Tentacool': 'Water',
 'Tentacruel': 'Water',
 'Geodude': 'Rock',
 'Graveler': 'Rock',
 'Golem': 'Rock',
 'Ponyta': 'Fire',
 'Rapidash': 'Fire',
 'Slowpoke': 'Water',
 'Slowbro': 'Water',
 'Magnemite': 'Electric',
 'Magneton': 'Electric',
 "Farfetch'd": 'Normal',
 'Doduo': 'Normal',
 'Dodrio': 'Normal',
 'Seel': 'Water',
 'Dewgong': 'Water',
 'Grimer': 'Poison',
 'Muk': 'Poison',
 'Shellder': 'Water',
 'Cloyster': 'Water',
 'Gastly': 'Ghost',
 'Haunter': 'Ghost',
 'Gengar': 'Ghost',
 'Onix': 'Rock',
 'Drowzee': 'Psychic',
 'Hypno': 'Psychic',
 'Krabby': 'Water',
 'Kingler': 'Water',
 'Voltorb': 'Electric',
 'Electrode': 'Electric',
 'Exeggcute': 'Grass',
 'Exeggutor': 'Grass',
 'Cubone': 'Ground',
 'Marowak': 'Ground',
 'Hitmonlee': 'Fighting',
 'Hitmonchan': 'Fighting',
 'Lickitung': 'Normal',
 'Koffing': 'Poison',
 'Weezing': 'Poison',
 'Rhyhorn': 'Ground',
 'Rhydon': 'Ground',
 'Chansey': 'Normal',
 'Tangela': 'Grass',
 'Kangaskhan': 'Normal',
 'Horsea': 'Water',
 'Seadra': 'Water',
 'Goldeen': 'Water',
 'Seaking': 'Water',
 'Staryu': 'Water',
 'Starmie': 'Water',
 'Mr. Mime': 'Psychic',
 'Scyther': 'Bug',
 'Jynx': 'Ice',
 'Electabuzz': 'Electric',
 'Magmar': 'Fire',
 'Pinsir': 'Bug',
 'Tauros': 'Normal',
 'Magikarp': 'Water',
 'Gyarados': 'Water',
 'Lapras': 'Water',
 'Ditto': 'Normal',
 'Eevee': 'Normal',
 'Vaporeon': 'Water',
 'Jolteon': 'Electric',
 'Flareon': 'Fire',
 'Porygon': 'Normal',
 'Omanyte': 'Rock',
 'Omastar': 'Rock',
 'Kabuto': 'Rock',
 'Kabutops': 'Rock',
 'Aerodactyl': 'Rock',
 'Snorlax': 'Normal',
 'Articuno': 'Ice',
 'Zapdos': 'Electric',
 'Moltres': 'Fire',
 'Dratini': 'Dragon',
 'Dragonair': 'Dragon',
 'Dragonite': 'Dragon',
 'Mewtwo': 'Psychic',
 'Mew': 'Psychic',
 'Chikorita': 'Grass',
 'Bayleef': 'Grass',
 'Meganium': 'Grass',
 'Cyndaquil': 'Fire',
 'Quilava': 'Fire',
 'Typhlosion': 'Fire',
 'Totodile': 'Water',
 'Croconaw': 'Water',
 'Feraligatr': 'Water',
 'Sentret': 'Normal',
 'Furret': 'Normal',
 'Hoothoot': 'Normal',
 'Noctowl': 'Normal',
 'Ledyba': 'Bug',
 'Ledian': 'Bug',
 'Spinarak': 'Bug',
 'Ariados': 'Bug',
 'Crobat': 'Poison',
 'Chinchou': 'Water',
 'Lanturn': 'Water',
 'Pichu': 'Electric',
 'Cleffa': 'Fairy',
 'Igglybuff': 'Normal',
 'Togepi': 'Fairy',
 'Togetic': 'Fairy',
 'Natu': 'Psychic',
 'Xatu': 'Psychic',
 'Mareep': 'Electric',
 'Flaaffy': 'Electric',
 'Ampharos': 'Electric',
 'Bellossom': 'Grass',
 'Marill': 'Water',
 'Azumarill': 'Water',
 'Sudowoodo': 'Rock',
 'Politoed': 'Water',
 'Hoppip': 'Grass',
 'Skiploom': 'Grass',
 'Jumpluff': 'Grass',
 'Aipom': 'Normal',
 'Sunkern': 'Grass',
 'Sunflora': 'Grass',
 'Yanma': 'Bug',
 'Wooper': 'Water',
 'Quagsire': 'Water',
 'Espeon': 'Psychic',
 'Umbreon': 'Dark',
 'Murkrow': 'Dark',
 'Slowking': 'Water',
 'Misdreavus': 'Ghost',
 'Unown': 'Psychic',
 'Wobbuffet': 'Psychic',
 'Girafarig': 'Normal',
 'Pineco': 'Bug',
 'Forretress': 'Bug',
 'Dunsparce': 'Normal',
 'Gligar': 'Ground',
 'Steelix': 'Steel',
 'Snubbull': 'Fairy',
 'Granbull': 'Fairy',
 'Qwilfish': 'Water',
 'Scizor': 'Bug',
 'Shuckle': 'Bug',
 'Heracross': 'Bug',
 'Sneasel': 'Dark',
 'Teddiursa': 'Normal',
 'Ursaring': 'Normal',
 'Slugma': 'Fire',
 'Magcargo': 'Fire',
 'Swinub': 'Ice',
 'Piloswine': 'Ice',
 'Corsola': 'Water',
 'Remoraid': 'Water',
 'Octillery': 'Water',
 'Delibird': 'Ice',
 'Mantine': 'Water',
 'Skarmory': 'Steel',
 'Houndour': 'Dark',
 'Houndoom': 'Dark',
 'Kingdra': 'Water',
 'Phanpy': 'Ground',
 'Donphan': 'Ground',
 'Porygon2': 'Normal',
 'Stantler': 'Normal',
 'Smeargle': 'Normal',
 'Tyrogue': 'Fighting',
 'Hitmontop': 'Fighting',
 'Smoochum': 'Ice',
 'Elekid': 'Electric',
 'Magby': 'Fire',
 'Miltank': 'Normal',
 'Blissey': 'Normal',
 'Raikou': 'Electric',
 'Entei': 'Fire',
 'Suicune': 'Water',
 'Larvitar': 'Rock',
 'Pupitar': 'Rock',
 'Tyranitar': 'Rock',
 'Lugia': 'Psychic',
 'Ho-oh': 'Fire',
 'Celebi': 'Psychic',
 'Treecko': 'Grass',
 'Grovyle': 'Grass',
 'Sceptile': 'Grass',
 'Torchic': 'Fire',
 'Combusken': 'Fire',
 'Blaziken': 'Fire',
 'Mudkip': 'Water',
 'Marshtomp': 'Water',
 'Swampert': 'Water',
 'Poochyena': 'Dark',
 'Mightyena': 'Dark',
 'Zigzagoon': 'Normal',
 'Linoone': 'Normal',
 'Wurmple': 'Bug',
 'Silcoon': 'Bug',
 'Beautifly': 'Bug',
 'Cascoon': 'Bug',
 'Dustox': 'Bug',
 'Lotad': 'Water',
 'Lombre': 'Water',
 'Ludicolo': 'Water',
 'Seedot': 'Grass',
 'Nuzleaf': 'Grass',
 'Shiftry': 'Grass',
 'Taillow': 'Normal',
 'Swellow': 'Normal',
 'Wingull': 'Water',
 'Pelipper': 'Water',
 'Ralts': 'Psychic',
 'Kirlia': 'Psychic',
 'Gardevoir': 'Psychic',
 'Surskit': 'Bug',
 'Masquerain': 'Bug',
 'Shroomish': 'Grass',
 'Breloom': 'Grass',
 'Slakoth': 'Normal',
 'Vigoroth': 'Normal',
 'Slaking': 'Normal',
 'Nincada': 'Bug',
 'Ninjask': 'Bug',
 'Shedinja': 'Bug',
 'Whismur': 'Normal',
 'Loudred': 'Normal',
 'Exploud': 'Normal',
 'Makuhita': 'Fighting',
 'Hariyama': 'Fighting',
 'Azurill': 'Normal',
 'Nosepass': 'Rock',
 'Skitty': 'Normal',
 'Delcatty': 'Normal',
 'Sableye': 'Dark',
 'Mawile': 'Steel',
 'Aron': 'Steel',
 'Lairon': 'Steel',
 'Aggron': 'Steel',
 'Meditite': 'Fighting',
 'Medicham': 'Fighting',
 'Electrike': 'Electric',
 'Manectric': 'Electric',
 'Plusle': 'Electric',
 'Minun': 'Electric',
 'Volbeat': 'Bug',
 'Illumise': 'Bug',
 'Roselia': 'Grass',
 'Gulpin': 'Poison',
 'Swalot': 'Poison',
 'Carvanha': 'Water',
 'Sharpedo': 'Water',
 'Wailmer': 'Water',
 'Wailord': 'Water',
 'Numel': 'Fire',
 'Camerupt': 'Fire',
 'Torkoal': 'Fire',
 'Spoink': 'Psychic',
 'Grumpig': 'Psychic',
 'Spinda': 'Normal',
 'Trapinch': 'Ground',
 'Vibrava': 'Ground',
 'Flygon': 'Ground',
 'Cacnea': 'Grass',
 'Cacturne': 'Grass',
 'Swablu': 'Normal',
 'Altaria': 'Dragon',
 'Zangoose': 'Normal',
 'Seviper': 'Poison',
 'Lunatone': 'Rock',
 'Solrock': 'Rock',
 'Barboach': 'Water',
 'Whiscash': 'Water',
 'Corphish': 'Water',
 'Crawdaunt': 'Water',
 'Baltoy': 'Ground',
 'Claydol': 'Ground',
 'Lileep': 'Rock',
 'Cradily': 'Rock',
 'Anorith': 'Rock',
 'Armaldo': 'Rock',
 'Feebas': 'Water',
 'Milotic': 'Water',
 'Castform': 'Normal',
 'Kecleon': 'Normal',
 'Shuppet': 'Ghost',
 'Banette': 'Ghost',
 'Duskull': 'Ghost',
 'Dusclops': 'Ghost',
 'Tropius': 'Grass',
 'Chimecho': 'Psychic',
 'Absol': 'Dark',
 'Wynaut': 'Psychic',
 'Snorunt': 'Ice',
 'Glalie': 'Ice',
 'Spheal': 'Ice',
 'Sealeo': 'Ice',
 'Walrein': 'Ice',
 'Clamperl': 'Water',
 'Huntail': 'Water',
 'Gorebyss': 'Water',
 'Relicanth': 'Water',
 'Luvdisc': 'Water',
 'Bagon': 'Dragon',
 'Shelgon': 'Dragon',
 'Salamence': 'Dragon',
 'Beldum': 'Steel',
 'Metang': 'Steel',
 'Metagross': 'Steel',
 'Regirock': 'Rock',
 'Regice': 'Ice',
 'Registeel': 'Steel',
 'Latias': 'Dragon',
 'Latios': 'Dragon',
 'Kyogre': 'Water',
 'Groudon': 'Ground',
 'Rayquaza': 'Dragon',
 'Jirachi': 'Steel',
 'Deoxys': 'Psychic',
 'Turtwig': 'Grass',
 'Grotle': 'Grass',
 'Torterra': 'Grass',
 'Chimchar': 'Fire',
 'Monferno': 'Fire',
 'Infernape': 'Fire',
 'Piplup': 'Water',
 'Prinplup': 'Water',
 'Empoleon': 'Water',
 'Starly': 'Normal',
 'Staravia': 'Normal',
 'Staraptor': 'Normal',
 'Bidoof': 'Normal',
 'Bibarel': 'Normal',
 'Kricketot': 'Bug',
 'Kricketune': 'Bug',
 'Shinx': 'Electric',
 'Luxio': 'Electric',
 'Luxray': 'Electric',
 'Budew': 'Grass',
 'Roserade': 'Grass',
 'Cranidos': 'Rock',
 'Rampardos': 'Rock',
 'Shieldon': 'Rock',
 'Bastiodon': 'Rock',
 'Burmy': 'Bug',
 'Wormadam': 'Bug',
 'Mothim': 'Bug',
 'Combee': 'Bug',
 'Vespiquen': 'Bug',
 'Pachirisu': 'Electric',
 'Buizel': 'Water',
 'Floatzel': 'Water',
 'Cherubi': 'Grass',
 'Cherrim': 'Grass',
 'Shellos': 'Water',
 'Gastrodon': 'Water',
 'Ambipom': 'Normal',
 'Drifloon': 'Ghost',
 'Drifblim': 'Ghost',
 'Buneary': 'Normal',
 'Lopunny': 'Normal',
 'Mismagius': 'Ghost',
 'Honchkrow': 'Dark',
 'Glameow': 'Normal',
 'Purugly': 'Normal',
 'Chingling': 'Psychic',
 'Stunky': 'Poison',
 'Skuntank': 'Poison',
 'Bronzor': 'Steel',
 'Bronzong': 'Steel',
 'Bonsly': 'Rock',
 'Mime Jr.': 'Psychic',
 'Happiny': 'Normal',
 'Chatot': 'Normal',
 'Spiritomb': 'Ghost',
 'Gible': 'Dragon',
 'Gabite': 'Dragon',
 'Garchomp': 'Dragon',
 'Munchlax': 'Normal',
 'Riolu': 'Fighting',
 'Lucario': 'Fighting',
 'Hippopotas': 'Ground',
 'Hippowdon': 'Ground',
 'Skorupi': 'Poison',
 'Drapion': 'Poison',
 'Croagunk': 'Poison',
 'Toxicroak': 'Poison',
 'Carnivine': 'Grass',
 'Finneon': 'Water',
 'Lumineon': 'Water',
 'Mantyke': 'Water',
 'Snover': 'Grass',
 'Abomasnow': 'Grass',
 'Weavile': 'Dark',
 'Magnezone': 'Electric',
 'Lickilicky': 'Normal',
 'Rhyperior': 'Ground',
 'Tangrowth': 'Grass',
 'Electivire': 'Electric',
 'Magmortar': 'Fire',
 'Togekiss': 'Fairy',
 'Yanmega': 'Bug',
 'Leafeon': 'Grass',
 'Glaceon': 'Ice',
 'Gliscor': 'Ground',
 'Mamoswine': 'Ice',
 'Porygon-Z': 'Normal',
 'Gallade': 'Psychic',
 'Probopass': 'Rock',
 'Dusknoir': 'Ghost',
 'Froslass': 'Ice',
 'Rotom': 'Electric',
 'Uxie': 'Psychic',
 'Mesprit': 'Psychic',
 'Azelf': 'Psychic',
 'Dialga': 'Steel',
 'Palkia': 'Water',
 'Heatran': 'Fire',
 'Regigigas': 'Normal',
 'Giratina': 'Ghost',
 'Cresselia': 'Psychic',
 'Phione': 'Water',
 'Manaphy': 'Water',
 'Darkrai': 'Dark',
 'Shaymin': 'Grass',
 'Arceus': 'Normal',
 'Victini': 'Psychic',
 'Snivy': 'Grass',
 'Servine': 'Grass',
 'Serperior': 'Grass',
 'Tepig': 'Fire',
 'Pignite': 'Fire',
 'Emboar': 'Fire',
 'Oshawott': 'Water',
 'Dewott': 'Water',
 'Samurott': 'Water',
 'Patrat': 'Normal',
 'Watchog': 'Normal',
 'Lillipup': 'Normal',
 'Herdier': 'Normal',
 'Stoutland': 'Normal',
 'Purrloin': 'Dark',
 'Liepard': 'Dark',
 'Pansage': 'Grass',
 'Simisage': 'Grass',
 'Pansear': 'Fire',
 'Simisear': 'Fire',
 'Panpour': 'Water',
 'Simipour': 'Water',
 'Munna': 'Psychic',
 'Musharna': 'Psychic',
 'Pidove': 'Normal',
 'Tranquill': 'Normal',
 'Unfezant': 'Normal',
 'Blitzle': 'Electric',
 'Zebstrika': 'Electric',
 'Roggenrola': 'Rock',
 'Boldore': 'Rock',
 'Gigalith': 'Rock',
 'Woobat': 'Psychic',
 'Swoobat': 'Psychic',
 'Drilbur': 'Ground',
 'Excadrill': 'Ground',
 'Audino': 'Normal',
 'Timburr': 'Fighting',
 'Gurdurr': 'Fighting',
 'Conkeldurr': 'Fighting',
 'Tympole': 'Water',
 'Palpitoad': 'Water',
 'Seismitoad': 'Water',
 'Throh': 'Fighting',
 'Sawk': 'Fighting',
 'Sewaddle': 'Bug',
 'Swadloon': 'Bug',
 'Leavanny': 'Bug',
 'Venipede': 'Bug',
 'Whirlipede': 'Bug',
 'Scolipede': 'Bug',
 'Cottonee': 'Grass',
 'Whimsicott': 'Grass',
 'Petilil': 'Grass',
 'Lilligant': 'Grass',
 'Basculin': 'Water',
 'Sandile': 'Ground',
 'Krokorok': 'Ground',
 'Krookodile': 'Ground',
 'Darumaka': 'Fire',
 'Darmanitan': 'Fire',
 'Maractus': 'Grass',
 'Dwebble': 'Bug',
 'Crustle': 'Bug',
 'Scraggy': 'Dark',
 'Scrafty': 'Dark',
 'Sigilyph': 'Psychic',
 'Yamask': 'Ghost',
 'Cofagrigus': 'Ghost',
 'Tirtouga': 'Water',
 'Carracosta': 'Water',
 'Archen': 'Rock',
 'Archeops': 'Rock',
 'Trubbish': 'Poison',
 'Garbodor': 'Poison',
 'Zorua': 'Dark',
 'Zoroark': 'Dark',
 'Minccino': 'Normal',
 'Cinccino': 'Normal',
 'Gothita': 'Psychic',
 'Gothorita': 'Psychic',
 'Gothitelle': 'Psychic',
 'Solosis': 'Psychic',
 'Duosion': 'Psychic',
 'Reuniclus': 'Psychic',
 'Ducklett': 'Water',
 'Swanna': 'Water',
 'Vanillite': 'Ice',
 'Vanillish': 'Ice',
 'Vanilluxe': 'Ice',
 'Deerling': 'Normal',
 'Sawsbuck': 'Normal',
 'Emolga': 'Electric',
 'Karrablast': 'Bug',
 'Escavalier': 'Bug',
 'Foongus': 'Grass',
 'Amoonguss': 'Grass',
 'Frillish': 'Water',
 'Jellicent': 'Water',
 'Alomomola': 'Water',
 'Joltik': 'Bug',
 'Galvantula': 'Bug',
 'Ferroseed': 'Grass',
 'Ferrothorn': 'Grass',
 'Klink': 'Steel',
 'Klang': 'Steel',
 'Klinklang': 'Steel',
 'Tynamo': 'Electric',
 'Eelektrik': 'Electric',
 'Eelektross': 'Electric',
 'Elgyem': 'Psychic',
 'Beheeyem': 'Psychic',
 'Litwick': 'Ghost',
 'Lampent': 'Ghost',
 'Chandelure': 'Ghost',
 'Axew': 'Dragon',
 'Fraxure': 'Dragon',
 'Haxorus': 'Dragon',
 'Cubchoo': 'Ice',
 'Beartic': 'Ice',
 'Cryogonal': 'Ice',
 'Shelmet': 'Bug',
 'Accelgor': 'Bug',
 'Stunfisk': 'Ground',
 'Mienfoo': 'Fighting',
 'Mienshao': 'Fighting',
 'Druddigon': 'Dragon',
 'Golett': 'Ground',
 'Golurk': 'Ground',
 'Pawniard': 'Dark',
 'Bisharp': 'Dark',
 'Bouffalant': 'Normal',
 'Rufflet': 'Normal',
 'Braviary': 'Normal',
 'Vullaby': 'Dark',
 'Mandibuzz': 'Dark',
 'Heatmor': 'Fire',
 'Durant': 'Bug',
 'Deino': 'Dark',
 'Zweilous': 'Dark',
 'Hydreigon': 'Dark',
 'Larvesta': 'Bug',
 'Volcarona': 'Bug',
 'Cobalion': 'Steel',
 'Terrakion': 'Rock',
 'Virizion': 'Grass',
 'Tornadus': 'Flying',
 'Thundurus': 'Electric',
 'Reshiram': 'Dragon',
 'Zekrom': 'Dragon',
 'Landorus': 'Ground',
 'Kyurem': 'Dragon',
 'Keldeo': 'Water',
 'Meloetta': 'Normal',
 'Genesect': 'Bug',
 'Chespin': 'Grass',
 'Quilladin': 'Grass',
 'Chesnaught': 'Grass',
 'Fennekin': 'Fire',
 'Braixen': 'Fire',
 'Delphox': 'Fire',
 'Froakie': 'Water',
 'Frogadier': 'Water',
 'Greninja': 'Water',
 'Bunnelby': 'Normal',
 'Diggersby': 'Normal',
 'Fletchling': 'Normal',
 'Fletchinder': 'Fire',
 'Talonflame': 'Fire',
 'Scatterbug': 'Bug',
 'Spewpa': 'Bug',
 'Vivillon': 'Bug',
 'Litleo': 'Fire',
 'Pyroar': 'Fire',
 'Flabébé': 'Fairy',
 'Floette': 'Fairy',
 'Florges': 'Fairy',
 'Skiddo': 'Grass',
 'Gogoat': 'Grass',
 'Pancham': 'Fighting',
 'Pangoro': 'Fighting',
 'Furfrou': 'Normal',
 'Espurr': 'Psychic',
 'Meowstic': 'Psychic',
 'Honedge': 'Steel',
 'Doublade': 'Steel',
 'Aegislash': 'Steel',
 'Spritzee': 'Fairy',
 'Aromatisse': 'Fairy',
 'Swirlix': 'Fairy',
 'Slurpuff': 'Fairy',
 'Inkay': 'Dark',
 'Malamar': 'Dark',
 'Binacle': 'Rock',
 'Barbaracle': 'Rock',
 'Skrelp': 'Poison',
 'Dragalge': 'Poison',
 'Clauncher': 'Water',
 'Clawitzer': 'Water',
 'Helioptile': 'Electric',
 'Heliolisk': 'Electric',
 'Tyrunt': 'Rock',
 'Tyrantrum': 'Rock',
 'Amaura': 'Rock',
 'Aurorus': 'Rock',
 'Sylveon': 'Fairy',
 'Hawlucha': 'Fighting',
 'Dedenne': 'Electric',
 'Carbink': 'Rock',
 'Goomy': 'Dragon',
 'Sliggoo': 'Dragon',
 'Goodra': 'Dragon',
 'Klefki': 'Steel',
 'Phantump': 'Ghost',
 'Trevenant': 'Ghost',
 'Pumpkaboo': 'Ghost',
 'Gourgeist': 'Ghost',
 'Bergmite': 'Ice',
 'Avalugg': 'Ice',
 'Noibat': 'Flying',
 'Noivern': 'Flying',
 'Xerneas': 'Fairy',
 'Yveltal': 'Dark',
 'Zygarde': 'Dragon',
 'Diancie': 'Rock',
 'Hoopa': 'Psychic',
 'Volcanion': 'Fire'}

In [1]:
import sys
sys.executable

'/Users/subhayanbhattacharya/Desktop/Studies/Codes/Python/Pandas/pandas_venv/bin/python'

In [2]:
import pandas as pd

nba = pd.read_csv("nba.csv")
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
nba.ndim

2

In [5]:
nba.shape

(458, 9)

In [6]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [13]:
check = pd.Series(["Subhayan", "Shaayan", "Dimpu", "Papa", 1, 2, 3])
check.dtypes

dtype('O')

In [9]:
nba.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
       [nan, nan, nan, ..., nan, nan, nan]], dtype=object)

In [10]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [14]:
check

0    Subhayan
1     Shaayan
2       Dimpu
3        Papa
4           1
5           2
6           3
dtype: object

In [15]:
new_series = pd.Series(i for i in range(10))

In [16]:
new_series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [18]:
new_series.dtypes

dtype('int64')

In [20]:
type(nba.dtypes)

pandas.core.series.Series

In [21]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [22]:
type(nba.columns)

pandas.core.indexes.base.Index

In [23]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [24]:
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [26]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [27]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [28]:
nba.dtypes.value_counts()

object     5
float64    4
dtype: int64

In [29]:
check

0    Subhayan
1     Shaayan
2       Dimpu
3        Papa
4           1
5           2
6           3
dtype: object

In [30]:
check.value_counts()

Papa        1
3           1
Dimpu       1
Shaayan     1
2           1
Subhayan    1
1           1
dtype: int64

In [33]:
revenue = pd.read_csv("revenue.csv", index_col='Date')

In [35]:
revenue.index

Index(['1/1/16', '1/2/16', '1/3/16', '1/4/16', '1/5/16', '1/6/16', '1/7/16',
       '1/8/16', '1/9/16', '1/10/16'],
      dtype='object', name='Date')

In [36]:
revenue.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 1/1/16 to 1/10/16
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   New York     10 non-null     int64
 1   Los Angeles  10 non-null     int64
 2   Miami        10 non-null     int64
dtypes: int64(3)
memory usage: 320.0+ bytes

In [39]:
revenue.dtypes.value_counts()

int64    3
dtype: int64

In [40]:
revenue.dtypes

New York       int64
Los Angeles    int64
Miami          int64
dtype: object

In [51]:
revenue["New York"]

Date
1/1/16     985
1/2/16     738
1/3/16      14
1/4/16     730
1/5/16     114
1/6/16     936
1/7/16     123
1/8/16     935
1/9/16     846
1/10/16     54
Name: New York, dtype: int64

In [47]:
type(revenue.sum(axis=1))

pandas.core.series.Series

In [3]:
import pandas as pd

nba = pd.read_csv("nba.csv")
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [75]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [76]:
import faker

f = faker.Faker()

nba.insert(0, "Programmer", [f.name() for _ in range(nba.index.start, nba.index.stop)], allow_duplicates=True)

In [68]:
nba.index.stop

458

In [77]:
nba.tail()

,Programmer,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Adam Miller,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Brooke Benjamin,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,John Ryan,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jacob Thomas,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,Lindsey Frost,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [1]:
nba

NameError: name 'nba' is not defined

In [5]:
nba["Salary"].add(1000)

0      7731337.0
1      6797117.0
2            NaN
3      1149640.0
4      5001000.0
         ...
453    2434333.0
454     901000.0
455    2901000.0
456     948276.0
457          NaN
Name: Salary, Length: 458, dtype: float64

In [8]:
nba["Team"].value_counts().head(1)

New Orleans Pelicans    19
Name: Team, dtype: int64

In [9]:
nba.dropna()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [10]:
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
check = pd.Series(["Subhayan", "Shayaan", "Dimpu", "Papa", "Mama"])
check

0    Subhayan
1     Shayaan
2       Dimpu
3        Papa
4        Mama
dtype: object

In [14]:
check[4]

'Mama'

In [17]:
nba.dropna(how='all').tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [1]:
import pandas as pd

nba = pd.read_csv("nba.csv")
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
nba["Age"] + 5

0      30.0
1      30.0
2      32.0
3      27.0
4      34.0
       ...
453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [4]:
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [14]:
nba.dropna(how='all')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [16]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [18]:
nba["Age"] = nba["Age"].fillna(0)

In [20]:
nba["Age"] = nba["Age"].astype("int")

In [21]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age           int64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [24]:
nba["Team"].nunique()

30

In [25]:
nba["College"].nunique()

118

In [27]:
nba["Position"].nunique()

5

In [29]:
nba["Position"] = nba["Position"].astype("category")

In [31]:
nba.dtypes

Name          object
Team          object
Number       float64
Position    category
Age            int64
Height        object
Weight       float64
College       object
Salary       float64
dtype: object

In [35]:
nba["Salary"] = nba["Salary"].fillna(0)

In [37]:
nba.sort_values("Salary", ascending=False)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37,6-6,212.0,NaN,25000000.0
169,LeBron James,Cleveland Cavaliers,23.0,SF,31,6-8,250.0,NaN,22970500.0
33,Carmelo Anthony,New York Knicks,7.0,SF,32,6-8,240.0,Syracuse,22875000.0
251,Dwight Howard,Houston Rockets,12.0,C,30,6-11,265.0,NaN,22359364.0
339,Chris Bosh,Miami Heat,1.0,PF,32,6-11,235.0,Georgia Tech,22192730.0
...,...,...,...,...,...,...,...,...,...
269,Ray McCallum,Memphis Grizzlies,5.0,PG,24,6-3,190.0,Detroit,0.0
409,Greg Smith,Minnesota Timberwolves,4.0,PF,25,6-10,250.0,Fresno State,0.0
2,John Holland,Boston Celtics,30.0,SG,27,6-5,205.0,Boston University,0.0
264,Jordan Farmar,Memphis Grizzlies,4.0,PG,29,6-2,180.0,UCLA,0.0
457,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,0.0

In [38]:
employees = pd.read_csv("employees.csv")
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [39]:
employees.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [41]:
pd.to_datetime(employees["Start Date"])

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [42]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [43]:
employees.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [44]:
employees["Start Date"] = pd.to_datetime(employees["Start Date"])

In [45]:
employees["Last Login Time"] = pd.to_datetime(employees["Last Login Time"])

In [47]:
employees.dtypes

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                         object
dtype: object

In [48]:
employees["Gender"] = employees["Gender"].astype("category")

In [53]:
employees.dtypes

First Name                   object
Gender                     category
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                       category
dtype: object

In [51]:
employees["Team"].nunique()

10

In [52]:
employees["Team"] = employees["Team"].astype("category")

In [54]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-07-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-07-14 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-07-14 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-07-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-07-14 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-07-14 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-07-14 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-07-14 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-07-14 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-07-14 18:24:00,129949,10.169,True,Sales

In [57]:
employees["Gender"] == "Male"

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

In [58]:
employees["Gender"].unique()

[Male, Female, NaN]
Categories (2, object): [Male, Female]

In [59]:
employees["Team"].unique()

[Marketing, NaN, Finance, Client Services, Legal, ..., Engineering, Business Development, Human Resources, Sales, Distribution]
Length: 11
Categories (10, object): [Marketing, Finance, Client Services, Legal, ..., Business Development, Human Resources, Sales, Distribution]

In [60]:
employees[employees["Team"] == "Marketing"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-07-14 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-07-14 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-07-14 07:45:00,37598,7.757,True,Marketing
43,Marilyn,Female,1980-12-07,2020-07-14 03:16:00,73524,5.207,True,Marketing
62,NaN,Female,2007-06-12,2020-07-14 17:25:00,58112,19.414,NaN,Marketing
...,...,...,...,...,...,...,...,...
942,Lori,Female,2015-11-20,2020-07-14 13:15:00,75498,6.537,True,Marketing
947,NaN,Male,2012-07-30,2020-07-14 15:07:00,107351,5.329,NaN,Marketing
986,Donna,Female,1982-11-26,2020-07-14 07:04:00,82871,17.999,False,Marketing
991,Rose,Female,2002-08-25,2020-07-14 05:12:00,134505,11.051,True,Marketing
994,George,Male,2013-06-21,2020-07-14 17:47:00,98874,4.479,True,Marketing

In [61]:
employees.dtypes

First Name                   object
Gender                     category
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                       category
dtype: object

In [62]:
employees["Senior Management"] = employees["Senior Management"].astype("category")

In [63]:
employees.dtypes

First Name                   object
Gender                     category
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management          category
Team                       category
dtype: object

In [64]:
employees[employees["Senior Management"]]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-07-14 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-07-14 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-07-14 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-07-14 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2020-07-14 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2020-07-14 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-07-14 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-07-14 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-07-14 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2020-07-14 18:24:00,129949,10.169,True,Sales

In [65]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    category
 7   Team               957 non-null    category
dtypes: category(3), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.7+ KB